#### Terraform Format and Style 🖌`success`

### ECR Changes
#### Terraform Plan 📖`success`
<details><summary>Show ECR Plan</summary>

```

module.ecr.aws_ecr_repository.repository["example"]: Refreshing state... [id=example]
module.ecr.aws_ecr_lifecycle_policy.lifecycle_policy["example"]: Refreshing state... [id=example]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

```

</details>

### Environment Changes (production)
#### Terraform Plan 📖`success`
<details><summary>Show Environment Plan</summary>

```

module.common.module.aws[0].data.aws_route53_zone.domain: Reading...
module.common.module.aws[0].module.services_ecs.data.aws_caller_identity.current: Reading...
module.common.module.aws[0].module.services_ecs.data.aws_ecr_repository.repos["example"]: Reading...
module.common.module.aws[0].module.services_ecs.data.aws_caller_identity.current: Read complete after 0s [id=794038238419]
module.common.module.aws[0].data.aws_route53_zone.domain: Read complete after 0s [id=Z020448818BB4783FJ4MP]
module.common.module.aws[0].module.services_ecs.data.aws_ecr_repository.repos["example"]: Read complete after 0s [id=example]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.module.aws[0].module.loadbalancer.aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "production.aws.krondor.org"
      + domain_validation_options = [
          + {
              + domain_name           = "production.aws.krondor.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "production.aws.krondor.org",
        ]
      + tags                      = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-acm-cert"
          + "Project"     = "example-turbo"
        }
      + tags_all                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-acm-cert"
          + "Project"     = "example-turbo"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.common.module.aws[0].module.loadbalancer.aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {
          + create = "30m"
        }
    }

  # module.common.module.aws[0].module.loadbalancer.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "production-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb"
          + "Project"     = "example-turbo"
        }
      + tags_all                                                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb"
          + "Project"     = "example-turbo"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.common.module.aws[0].module.loadbalancer.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.common.module.aws[0].module.loadbalancer.aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }
    }

  # module.common.module.aws[0].module.loadbalancer.aws_route53_record.acm_validation["production.aws.krondor.org"] will be created
  + resource "aws_route53_record" "acm_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z020448818BB4783FJ4MP"
    }

  # module.common.module.aws[0].module.loadbalancer.aws_route53_record.alb will be created
  + resource "aws_route53_record" "alb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "production"
      + type            = "A"
      + zone_id         = "Z020448818BB4783FJ4MP"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.common.module.aws[0].module.loadbalancer.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "production-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Project"     = "example-turbo"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-alb-sg"
          + "Project"     = "example-turbo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Project"     = "example-turbo"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat-eip"
          + "Project"     = "example-turbo"
        }
      + vpc                  = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Project"     = "example-turbo"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-igw"
          + "Project"     = "example-turbo"
        }
      + vpc_id   = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat"
          + "Project"     = "example-turbo"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-nat"
          + "Project"     = "example-turbo"
        }
    }

  # module.common.module.aws[0].module.networking.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Project"     = "example-turbo"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-rt"
          + "Project"     = "example-turbo"
        }
      + vpc_id           = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Project"     = "example-turbo"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-rt"
          + "Project"     = "example-turbo"
        }
      + vpc_id           = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1a"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1a"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1b"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1b"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1c"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-private-us-east-1c"
          + "Project"     = "example-turbo"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1a"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1a"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1b"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1b"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1c"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-public-us-east-1c"
          + "Project"     = "example-turbo"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.common.module.aws[0].module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Project"     = "example-turbo"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-vpc"
          + "Project"     = "example-turbo"
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_appautoscaling_policy.ecs_policy_cpu["example"] will be created
  + resource "aws_appautoscaling_policy" "ecs_policy_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "production-example-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/production-services/production-example"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_appautoscaling_target.ecs_target["example"] will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + resource_id        = "service/production-services/production-example"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.common.module.aws[0].module.services_ecs.aws_cloudwatch_log_group.service_logs["example"] will be created
  + resource "aws_cloudwatch_log_group" "service_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/production-example"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production-services"
      + tags     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-cluster"
          + "Project"     = "example-turbo"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-cluster"
          + "Project"     = "example-turbo"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_ecs_cluster_capacity_providers.cluster_cp will be created
  + resource "aws_ecs_cluster_capacity_providers" "cluster_cp" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "production-services"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_ecs_service.service["example"] will be created
  + resource "aws_ecs_service" "service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + force_new_deployment               = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "production-example"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "example"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_ecs_task_definition.service_task["example"] will be created
  + resource "aws_ecs_task_definition" "service_task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 512
                  + environment      = [
                      + {
                          + name  = "BASE_PATH"
                          + value = "/example"
                        },
                      + {
                          + name  = "ENV"
                          + value = "production"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:3000/example/_status/readyz || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 60
                      + timeout     = 5
                    }
                  + image            = "794038238419.dkr.ecr.us-east-1.amazonaws.com/example:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/production-example"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 1024
                  + name             = "example"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "production-example"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + tags_all                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.common.module.aws[0].module.services_ecs.aws_iam_role.execution_role will be created
  + resource "aws_iam_role" "execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-services-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + unique_id             = (known after apply)
    }

  # module.common.module.aws[0].module.services_ecs.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production-services-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.common.module.aws[0].module.services_ecs.aws_iam_role_policy.execution_role_policy will be created
  + resource "aws_iam_role_policy" "execution_role_policy" {
      + id          = (known after apply)
      + name        = "production-services-execution-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.common.module.aws[0].module.services_ecs.aws_iam_role_policy.task_role_policy will be created
  + resource "aws_iam_role_policy" "task_role_policy" {
      + id          = (known after apply)
      + name        = "production-services-task-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.common.module.aws[0].module.services_ecs.aws_lb_listener_rule.service_rule["example"] will be created
  + resource "aws_lb_listener_rule" "service_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/example/*",
                ]
            }
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_lb_target_group.service_tg["example"] will be created
  + resource "aws_lb_target_group" "service_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "production-example-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Project"     = "example-turbo"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-299"
          + path                = "/example/_status/readyz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.common.module.aws[0].module.services_ecs.aws_security_group.service will be created
  + resource "aws_security_group" "service" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS service"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow incoming traffic from ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 65535
            },
        ]
      + name                   = "production-services-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-services-sg"
          + "Project"     = "example-turbo"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "production-services-sg"
          + "Project"     = "example-turbo"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
